project02/app/controllers/store_controller.rb

INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2011-02-01 03:19:16', 2, 1, 1, 29.95, '2011-02-01 03:19:16')
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('John Smith', '123 Main St', '2011-02-01 03:19:16', '2011-02-01 03:19:16', 'check', 'jsmith@gmail.com')
---
  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save