project02/app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def update
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
DELETE FROM "users" WHERE "id" = 1
---
  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy